АлогистикТест2/src/Documents/алк_УстановкаПараметровКатегорииПЭО/алк_УстановкаПараметровКатегорииПЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаПараметровКатегорииПЭО</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредставлениеСоставаКатегорииПЭО</name>
    <attributes>
      <name>ДлинаСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СечениеСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПородаСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКатегорииПЭО</name>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>CatalogRef.Влажность</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Несортированный</name>
      <description>Несортированный</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
  </predefined>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыписыватьГарантийныйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПрайсЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендуемЗаказать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияФлагаНовинка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭДГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяНоменклатураВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто (кг)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_УстановкаПараметровКатегорииПЭО/Forms/ФормаДокумента/Module.bsl
///////////////////////////////////////////////////////// РАБОЧАЯ ОБЛАСТЬ ////////////////////////////////  

#Область СобытияФормы 
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001"); //Пиломатериал
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВопросПриИзмененииНомеклатуры("Текущие данные по номенклатуре будут очищены! Продолжить?",Объект.Номенклатура,ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура КатегорияПЭООбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВопросПриИзмененииНомеклатуры("Текущие данные по категории будут очищены! Продолжить?",Объект.КатегорияПЭО,ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти 
 
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	//добавим предстваление категории
	СтрПредставленияКатегории = Объект.ПредставлениеСоставаКатегорииПЭО.Добавить();  
	//\\
	
	//установим идентификатор строки
	Идентификатор = Новый УникальныйИдентификатор;
	Если Объект.ПредставлениеСоставаКатегорииПЭО.НайтиСтроки(Новый Структура("Ключ",Строка(Идентификатор))).Количество() <> 0 Тогда
		Идентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	СтрПредставленияКатегории.Ключ = Идентификатор;
	//\\
	
	//откроем форму установки состава категории
	СтруктураДляФормыСостава = Новый Структура("ПараметрыЗаполнения", Новый Структура("Ключ, МассивСостава,КатегорияНоменклатуры"
			, Идентификатор
			, ПолучитьМассивСоставаПоКлючуСвязи(Идентификатор)
	        , ПолучитьКатегориюНоменклатуры(Объект.Номенклатура)));
	
	ОповещениеОВыборе  = Новый ОписаниеОповещения("ПослеЗакрытияСоставаТоваров", ЭтаФорма, Новый Структура("ИмяКоманды, Ключ", Команда.Имя, Идентификатор));
	ОткрытьФорму("Документ.алк_УстановкаПараметровКатегорииПЭО.Форма.ФормаСоставаКатегорииПЭО"
		, СтруктураДляФормыСостава
		, ЭтаФорма
		, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//\\
КонецПроцедуры  

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекДанные = Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		СообщитьИУказатьПользователю("Выберите строку для удаления!","Объект.ПредставлениеСоставаКатегорииПЭО[0]");
		Возврат;
	КонецЕсли;
	
	Объект.ПредставлениеСоставаКатегорииПЭО.Удалить(ТекДанные); 
		
	Для Каждого эл ИЗ Объект.СоставКатегорииПЭО.НайтиСтроки(Новый Структура("Ключ",Строка(ТекДанные.Ключ))) Цикл
		Объект.СоставКатегорииПЭО.Удалить(эл);
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	
	ТекДанные = Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		СообщитьИУказатьПользователю("Выберите строку для редактирования!","Объект.ПредставлениеСоставаКатегорииПЭО[0]");   
		Возврат;
	КонецЕсли; 
	
	Идентификатор = ТекДанные.Ключ;
	
	//откроем форму установки состава категории
	СтруктураДляФормыСостава = Новый Структура("ПараметрыЗаполнения", Новый Структура("Ключ, МассивСостава,КатегорияНоменклатуры"
			, Идентификатор
			, ПолучитьМассивСоставаПоКлючуСвязи(Идентификатор)
	        , ПолучитьКатегориюНоменклатуры(Объект.Номенклатура)));
	
	ОповещениеОВыборе  = Новый ОписаниеОповещения("ПослеЗакрытияСоставаТоваров", ЭтаФорма, Новый Структура("ИмяКоманды, Ключ", Команда.Имя, Идентификатор));
	ОткрытьФорму("Документ.алк_УстановкаПараметровКатегорииПЭО.Форма.ФормаСоставаКатегорииПЭО"
		, СтруктураДляФормыСостава
		, ЭтаФорма
		, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//\\	
КонецПроцедуры

#КонецОбласти 

#Область ВспомогательныеПроцедуры  

&НаКлиенте
Процедура ВопросПриИзмененииНомеклатуры(Вопрос,РеквизитДоИзменения,РеквизитПослеИзменений)
	
	Если Объект.ПредставлениеСоставаКатегорииПЭО.Количество() = 0 Тогда  
		Если ТипЗнч(РеквизитДоИзменения) = Тип("СправочникСсылка.Номенклатура") Тогда 
			Объект.Номенклатура = РеквизитПослеИзменений; 
		Иначе
			Объект.КатегорияПЭО = РеквизитПослеИзменений; 
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПоИзменениюРеквизита",
	ЭтотОбъект,Новый Структура("РеквизитДоИзменения,РеквизитПослеИзменений",РеквизитДоИзменения,РеквизитПослеИзменений));	
	
	ПоказатьВопрос(Оповещение,
	Вопрос,
	РежимДиалогаВопрос.ДаНет,
	0, 
	КодВозвратаДиалога.Да, 
	"Внимание!" 
	);    
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПоИзменениюРеквизита(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Если ТипЗнч(Параметры.РеквизитДоИзменения) = Тип("СправочникСсылка.Номенклатура") Тогда 
			Объект.Номенклатура = Параметры.РеквизитДоИзменения; 
		Иначе
			Объект.КатегорияПЭО = Параметры.РеквизитДоИзменения; 
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Если ТипЗнч(Параметры.РеквизитДоИзменения) = Тип("СправочникСсылка.Номенклатура") Тогда 
			Объект.КатегорияПЭО =  ""; 
			Объект.Номенклатура = Параметры.РеквизитПослеИзменений; 
		Иначе
			Объект.Номенклатура = "";
			Объект.КатегорияПЭО = Параметры.РеквизитПослеИзменений;
		КонецЕсли;
		Объект.СоставКатегорииПЭО.Очистить();
		Объект.ПредставлениеСоставаКатегорииПЭО.Очистить();	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СообщитьИУказатьПользователю(Сообщение,ИмяПоля)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Сообщение;
	Сообщение.Поле = ИмяПоля;
	Сообщение.Сообщить();
КонецПроцедуры 

&НаКлиенте 
Процедура ПослеЗакрытияСоставаТоваров(Результат, ДопПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	МассивСоставаДокумента = Объект.СоставКатегорииПЭО.НайтиСтроки(Новый Структура("Ключ", Строка(ДопПараметры.Ключ)));
		
	Если Результат.Свойство("МассивСостава") Тогда
		//Определяем какие надо удалить
		СтрокиДляУдаления = РазностьМассивов(МассивСоставаДокумента, Результат.МассивСостава);
		Если СтрокиДляУдаления.Количество() > 0 Тогда
			Модифицированность = Истина;
			Для Каждого СтрокаУдалить из СтрокиДляУдаления Цикл
				Объект.СоставКатегорииПЭО.Удалить(СтрокаУдалить);
			КонецЦикла;
		КонецЕсли;
		//Определяем какие строки надо добавить новые
		СтрокиДляДобавления = РазностьМассивов(Результат.МассивСостава, МассивСоставаДокумента);
		Если СтрокиДляДобавления.Количество() > 0 Тогда
			Модифицированность = Истина;
			Для Каждого СтрокаДобавить из СтрокиДляДобавления Цикл
				СтрокаСостава = Объект.СоставКатегорииПЭО.Добавить(); 
				ЗаполнитьЗначенияСвойств(СтрокаСостава, СтрокаДобавить);
				СтрокаСостава.Ключ = ДопПараметры.Ключ; 
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПредставлениеСоставаКатегорииПЭО(Строка(ДопПараметры.Ключ));
		
	ПоискПересечений(Строка(ДопПараметры.Ключ), Объект.СоставКатегорииПЭО, Ложь);
		
КонецПроцедуры    

&НаСервере
Процедура УстановитьПредставлениеСоставаКатегорииПЭО(Ид)    
	
	МассивСтрокПоИД = Объект.СоставКатегорииПЭО.НайтиСтроки(Новый Структура("Ключ",Ид));
	
	МассивДлинСоставаТоваров = Объект.СоставКатегорииПЭО.Выгрузить(МассивСтрокПоИД,"Длина").ВыгрузитьКолонку("Длина"); 	
	МассивСеченийСоставаТоваров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Объект.СоставКатегорииПЭО.Выгрузить(МассивСтрокПоИД,"Сечение").ВыгрузитьКолонку("Сечение"));  
	МассивПородСоставаТоваров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Объект.СоставКатегорииПЭО.Выгрузить(МассивСтрокПоИД,"Порода").ВыгрузитьКолонку("Порода"));
	МассивВлажностейСоставаТоваров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Объект.СоставКатегорииПЭО.Выгрузить(МассивСтрокПоИД,"Влажность").ВыгрузитьКолонку("Влажность"));    
	
	СтрокиПредставленияПоИд = Объект.ПредставлениеСоставаКатегорииПЭО.НайтиСтроки(Новый Структура("Ключ",Ид)); 
	
	Для Каждого стр ИЗ СтрокиПредставленияПоИд Цикл
		ИндексТекСтроки = Объект.ПредставлениеСоставаКатегорииПЭО.Индекс(стр);  
		Объект.ПредставлениеСоставаКатегорииПЭО[ИндексТекСтроки].ДлинаСтр = ПолучитьНаименованиеРеквизита(МассивДлинСоставаТоваров);
		Объект.ПредставлениеСоставаКатегорииПЭО[ИндексТекСтроки].СечениеСтр = ПолучитьНаименованиеРеквизита(МассивСеченийСоставаТоваров);
		Объект.ПредставлениеСоставаКатегорииПЭО[ИндексТекСтроки].ПородаСтр = ПолучитьНаименованиеРеквизита(МассивПородСоставаТоваров);
		
		//для вжаности уберем скобки
		НаименВл = СтрЗаменить(ПолучитьНаименованиеРеквизита(МассивВлажностейСоставаТоваров),"(","");   
		НаименВл = СтрЗаменить(НаименВл,")","");

		Объект.ПредставлениеСоставаКатегорииПЭО[ИндексТекСтроки].ВлажностьСтр = НаименВл;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ПоискПересечений(Ключ, Знач ВсеДанные, ТребуетсяЗаписьЖР = Ложь) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТекущиеДанные.Длина,
	               |	ТекущиеДанные.Сечение,
	               |	ТекущиеДанные.Порода,
	               |	ТекущиеДанные.Влажность,
	               |	ТекущиеДанные.Ключ,
	               |	ТекущиеДанные.НомерСтроки
	               |ПОМЕСТИТЬ ТекущиеДанные
	               |ИЗ
	               |	&ТекущиеДанные КАК ТекущиеДанные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеДанные.Длина,
	               |	ВсеДанные.Сечение,
	               |	ВсеДанные.Порода,
	               |	ВсеДанные.Влажность,
	               |	ВсеДанные.Ключ,
	               |	ВсеДанные.НомерСтроки
	               |ПОМЕСТИТЬ ВсеДанные
	               |ИЗ
	               |	&ВсеДанные КАК ВсеДанные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТекущиеДанные.Длина,
	               |	ТекущиеДанные.Сечение,
	               |	ТекущиеДанные.Порода,
	               |	ТекущиеДанные.Влажность,
	               |	ТекущиеДанные.Ключ,
	               |	ТекущиеДанные.НомерСтроки
	               |ИЗ
	               |	ВсеДанные КАК ВсеДанные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущиеДанные КАК ТекущиеДанные
	               |		ПО (ТекущиеДанные.Длина = ВсеДанные.Длина)
	               |			И (ТекущиеДанные.Сечение = ВсеДанные.Сечение)
	               |			И (ТекущиеДанные.Порода = ВсеДанные.Порода)
	               |			И (ТекущиеДанные.Влажность = ВсеДанные.Влажность)
	               |			И (ТекущиеДанные.НомерСтроки <> ВсеДанные.НомерСтроки)"; 
			
	Запрос.УстановитьПараметр("ТекущиеДанные", Объект.СоставКатегорииПЭО.Выгрузить(Объект.СоставКатегорииПЭО.НайтиСтроки(Новый Структура("Ключ",Ключ))));
	Запрос.УстановитьПараметр("ВсеДанные", ВсеДанные.Выгрузить());
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() <> 0 Тогда 
		
		Сообщение = "Пересекаются составы категории ПЭО:" + Символы.ПС;
		Для каждого Строка из РезультатЗапроса Цикл
			МассивСтрокПоИД = Объект.ПредставлениеСоставаКатегорииПЭО.НайтиСтроки(Новый Структура("Ключ",Строка.Ключ));
			Сообщение = Сообщение + СтрШаблон("Строка %1 ", МассивСтрокПоИД[0].НомерСтроки) + СтрШаблон("(Длина: %1, Сечение: %2, Порода: %3, Влажность: %4)" + Символы.ПС, Строка.Длина, Строка.Сечение, Строка.Порода,Строка.Влажность);
		КонецЦикла; 		
		Сообщить(Сообщение);
		
		//Если ТребуетсяЗаписьЖР Тогда 
		//	ЗаписьЖурналаРегистрации("ПересечениеСоставаТоваров", УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Записан документ КП №%1 от %2 с пересекающимся составом товаров", Объект.Номер, Объект.Дата));  
		//КонецЕсли;
		//
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ВспомогательныеФункции

&НаСервере
Функция ПолучитьМассивСоставаПоКлючуСвязи(КлючСвязи)
	ОтборСтрокСостава = Новый Структура("Ключ", Строка(КлючСвязи));
	СтрокиСостава = Объект.СоставКатегорииПЭО.НайтиСтроки(ОтборСтрокСостава);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.СоставКатегорииПЭО.Выгрузить(СтрокиСостава));	
КонецФункции 

&НаСервере
Функция ПолучитьНаименованиеРеквизита(МассивСтрок) 
	Строка = "";
	Для Каждого эл ИЗ МассивСтрок Цикл   
		Строка = Строка + эл + "/";	
	КонецЦикла;	  
	Возврат Лев(Строка,СтрДлина(Строка)-1);
КонецФункции

&НаКлиенте
Функция РазностьМассивов(Массив, МассивВычитания)
	Результат = Новый Массив;
	Если МассивВычитания.Количество() = 0 Тогда
		Возврат Массив;
	КонецЕсли;
	Для каждого ЭлементМассив Из Массив Цикл
		НашлиЗапись = Ложь;
		Для Каждого ЭлементВычитания из МассивВычитания Цикл
			ЭлементКолонок = ?(ТипЗнч(ЭлементМассив) = Тип("Структура"), ЭлементМассив, ЭлементВычитания); 
			НашлиЗапись = Истина;
			Для Каждого РеквизитСравнения Из ЭлементКолонок Цикл
				Если ЭлементМассив[РеквизитСравнения.Ключ] <> ЭлементВычитания[РеквизитСравнения.Ключ] Тогда
					НашлиЗапись = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла; 
			Если НашлиЗапись Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не НашлиЗапись Тогда
			Результат.Добавить(ЭлементМассив);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКатегориюНоменклатуры(Номенклатура) 
	Возврат Номенклатура.КатегорияНоменклатуры;
КонецФункции 


#КонецОбласти

////////////////////////////////////////////////////////////////////////////////////////



///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//&НаСервереБезКонтекста
//// Функция "расщепляет" строку на подстроки, используя заданный 
////		разделитель. Разделитель может иметь любую длину. 
////		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
////		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
////		игнорируются.
////		Например, 
////		РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
////		три из которых - пустые строки, а 
////		РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов
////
////	Параметры: 
////		Стр - строка, которую необходимо разложить на подстроки. 
////		Разделитель - 	строка-разделитель, по умолчанию - запятая.
////
////	Возвращаемое значение:
////		массив значений, элементы которого - подстроки
////       
//Функция РазложитьСтрокуВМассив(Знач Стр, Разделитель = ",") Экспорт
//	
//	МассивСтрок = Новый Массив();
//	Если Разделитель = " " Тогда
//		Стр = СокрЛП(Стр);
//		Пока 1=1 Цикл
//			Поз = Найти(Стр,Разделитель);
//			Если Поз=0 Тогда
//				МассивСтрок.Добавить(Стр);
//				Возврат МассивСтрок;
//			КонецЕсли;
//			МассивСтрок.Добавить(Лев(Стр,Поз-1));
//			Стр = СокрЛ(Сред(Стр,Поз));
//		КонецЦикла;
//	Иначе
//		ДлинаРазделителя = СтрДлина(Разделитель);
//		Пока 1=1 Цикл
//			Поз = Найти(Стр,Разделитель);
//			Если Поз=0 Тогда
//				МассивСтрок.Добавить(Стр);
//				Возврат МассивСтрок;
//			КонецЕсли;
//			МассивСтрок.Добавить(Лев(Стр,Поз-1));
//			Стр = Сред(Стр,Поз+ДлинаРазделителя);
//		КонецЦикла;
//	КонецЕсли;
//	
//КонецФункции   


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//&НаСервере
//Процедура НоменклатураПриИзмененииНаСервере() 
//	
//	Объект.КатегорияНоменклатуры = Объект.Номенклатура.КатегорияНоменклатуры;	
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура НоменклатураПриИзменении(Элемент)
//	НоменклатураПриИзмененииНаСервере(); 	
//КонецПроцедуры   

//// обработка Длин влажности  
//&НаКлиенте
//Процедура ТабличнаяЧастьПредставлениеДлинаСтрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные;
//	
//	СписокДляВыбора = СписокДлинНачалоВыбораНаСервере(ТекущиеДанные.ДлинаСтр);
//	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементовДлин", ЭтаФорма);
//	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Длина"); 
//		
//КонецПроцедуры

//&НаСервере
//Функция СписокДлинНачалоВыбораНаСервере(СтрокаВыбранных)
//	
//	МассивВыбранных = РазложитьСтрокуВМассив(СтрокаВыбранных, "; ");
//	
//	СписокДляВыбора = Новый СписокЗначений;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Длины.Наименование КАК Наименование,
//	|	Длины.Наименование В (&МассивВыбранных) КАК Отметка
//	|ИЗ
//	|	Справочник.Длины КАК Длины
//	|ГДЕ
//	|	Длины.Владелец = &Владелец
//	|	И НЕ Длины.ПометкаУдаления
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Наименование";
//	
//	Запрос.УстановитьПараметр("Владелец", Объект.КатегорияНоменклатуры); 
//	Запрос.УстановитьПараметр("МассивВыбранных", МассивВыбранных);
//		
//	РезультатЗапроса = Запрос.Выполнить(); 	
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Наименование,,ВыборкаДетальныеЗаписи.Отметка,);		
//	КонецЦикла;
//	
//	Возврат СписокДляВыбора;
//	
//КонецФункции 

//&НаКлиенте
//Процедура ПослеОтметкиЭлементовДлин(СписокДляВыбора, Параметры) Экспорт
//	
//	Если СписокДляВыбора <> Неопределено Тогда
//		
//		СписокДлин = "";
//		Для каждого Элемент Из СписокДляВыбора Цикл
//			Если Элемент.Пометка Тогда
//				СписокДлин = СписокДлин + Элемент.Значение + "; ";
//			КонецЕсли;
//		КонецЦикла;
//		
//		СтрокаТабличнойЧасти = Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные;
//		СтрокаТабличнойЧасти.ДлинаСтр = СписокДлин;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//// обработка выбора порода  
//&НаКлиенте
//Процедура ТабличнаяЧастьПредставлениеПородаСтрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные;
//	
//	СписокДляВыбора = СписокПородаНачалоВыбораНаСервере(ТекущиеДанные.ПородаСтр);
//	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементовПорода", ЭтаФорма);
//	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Порода"); 
//		
//КонецПроцедуры

//&НаСервере
//Функция СписокПородаНачалоВыбораНаСервере(СтрокаВыбранных)
//	
//	МассивВыбранных = РазложитьСтрокуВМассив(СтрокаВыбранных, "; ");
//	
//	СписокДляВыбора = Новый СписокЗначений;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Породы.Наименование КАК Наименование,
//	|	Породы.Наименование В (&МассивВыбранных) КАК Отметка
//	|ИЗ
//	|	Справочник.Породы КАК Породы
//	|ГДЕ
//	|	НЕ Породы.ПометкаУдаления
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Наименование";
//	
//	Запрос.УстановитьПараметр("МассивВыбранных", МассивВыбранных);
//		
//	РезультатЗапроса = Запрос.Выполнить(); 	
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Наименование,,ВыборкаДетальныеЗаписи.Отметка,);		
//	КонецЦикла;
//	
//	Возврат СписокДляВыбора;
//	
//КонецФункции 

//&НаКлиенте
//Процедура ПослеОтметкиЭлементовПорода(СписокДляВыбора, Параметры) Экспорт
//	
//	Если СписокДляВыбора <> Неопределено Тогда
//		
//		СписокПорода = "";
//		Для каждого Элемент Из СписокДляВыбора Цикл
//			Если Элемент.Пометка Тогда
//				СписокПорода = СписокПорода + Элемент.Значение + "; ";
//			КонецЕсли;
//		КонецЦикла;
//		
//		СтрокаТабличнойЧасти = Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные;
//		СтрокаТабличнойЧасти.ПородаСтр = СписокПорода; 
//				
//	КонецЕсли;
//	
//КонецПроцедуры

//// обработка выбора влажности   
//&НаКлиенте
//Процедура ТабличнаяЧастьПредставлениеВлажностьСтрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные;
//	
//	СписокДляВыбора = СписокВлажностиНачалоВыбораНаСервере(ТекущиеДанные.ВлажностьСтр);
//	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементовВлажности", ЭтаФорма);
//	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Влажность"); 
//		
//КонецПроцедуры

//&НаСервере
//Функция СписокВлажностиНачалоВыбораНаСервере(СтрокаВыбранных)
//	
//	МассивВыбранных = РазложитьСтрокуВМассив(СтрокаВыбранных, "; ");
//	
//	СписокДляВыбора = Новый СписокЗначений;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Влажность.Наименование КАК Наименование,
//	|	Влажность.Наименование В (&МассивВыбранных) КАК Отметка
//	|ИЗ
//	|	Справочник.Влажность КАК Влажность
//	|ГДЕ
//	|	Влажность.Владелец = &Владелец
//	|	И НЕ Влажность.ПометкаУдаления
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Наименование";
//	
//	Запрос.УстановитьПараметр("Владелец", Объект.КатегорияНоменклатуры); 
//	Запрос.УстановитьПараметр("МассивВыбранных", МассивВыбранных);
//		
//	РезультатЗапроса = Запрос.Выполнить(); 	
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Наименование,,ВыборкаДетальныеЗаписи.Отметка,);		
//	КонецЦикла;
//	
//	Возврат СписокДляВыбора;
//	
//КонецФункции 

//&НаКлиенте
//Процедура ПослеОтметкиЭлементовВлажности(СписокДляВыбора, Параметры) Экспорт
//	
//	Если СписокДляВыбора <> Неопределено Тогда
//		
//		СписокВлажность = "";
//		Для каждого Элемент Из СписокДляВыбора Цикл
//			Если Элемент.Пометка Тогда
//				СписокВлажность = СписокВлажность + Элемент.Значение + "; ";
//			КонецЕсли;
//		КонецЦикла;
//		
//		СтрокаТабличнойЧасти = Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные;
//		СтрокаТабличнойЧасти.ВлажностьСтр = СписокВлажность; 
//				
//	КонецЕсли;
//	
//КонецПроцедуры 

//&НаКлиенте
//Процедура ТабличнаяЧастьПредставлениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

//	Уникальный = ложь;
//	НовыйИдентификатор = "";
//	Пока Не Уникальный Цикл
//		НовыйИдентификатор = ПолучитьНовыйУникальныйИдентификатор();
//		Уникальный = Истина;
//		Для каждого Стр из Объект.ТабличнаяЧастьПредставление Цикл
//			Если Стр.Ключ = НовыйИдентификатор тогда
//				Уникальынй = ложь;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//	
//	НоваяСтрока = Объект.ТабличнаяЧастьПредставление.Добавить();
//	
//	Если Копирование Тогда  
//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные);	
//	КонецЕсли; 
//	
//	НоваяСтрока.Ключ = НовыйИдентификатор;
//			
//	Отказ = Истина;
//	
//КонецПроцедуры

// &НаСервереБезКонтекста
//Функция ПолучитьНовыйУникальныйИдентификатор()
//	Возврат Строка(новый УникальныйИдентификатор());
//КонецФункции  

//&НаКлиенте
//Процедура ТабличнаяЧастьПредставлениеПриИзменении(Элемент) 
//	
//	ТекущиеДанные = Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные;
//	
//	Ключ = 			ТекущиеДанные.Ключ;
//	Сечение = 		ТекущиеДанные.Сечение;
//	
//	мДлина = 		ПолучитьСсылкиПоИменам(РазложитьСтрокуВМассив(ТекущиеДанные.ДлинаСтр, "; "), "ДлинаСтр");	
//	мПорода = 		ПолучитьСсылкиПоИменам(РазложитьСтрокуВМассив(ТекущиеДанные.ПородаСтр, "; "), "ПородаСтр");
//	мВлажность = 	ПолучитьСсылкиПоИменам(РазложитьСтрокуВМассив(ТекущиеДанные.ВлажностьСтр, "; "), "ВлажностьСтр"); 
//	
//	ТабличнаяЧасть = Объект.ТабличнаяЧасть;
//	
//	Для каждого эДлина Из мДлина Цикл		
//		Для каждого эПорода Из мПорода Цикл 			
//			Для каждого эВлажность Из мВлажность Цикл 
//				
//				НоваяСтрока = ТабличнаяЧасть.Добавить();
//				
//				НоваяСтрока.Длина = эДлина;
//				НоваяСтрока.Сечение = Сечение;
//				НоваяСтрока.Порода = эПорода;
//				НоваяСтрока.Влажность = эВлажность;
//				НоваяСтрока.Ключ = Ключ;			
//				
//			КонецЦикла;		
//		КонецЦикла;	
//	КонецЦикла;

//КонецПроцедуры 

//&НаСервере
//Функция ПолучитьСсылкиПоИменам(МассивИмён, ТипИмени)  
//	
//	Запрос = Новый Запрос;
//	
//	Если ТипИмени = "ДлинаСтр" Тогда		
//		
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Длины.Ссылка
//		|ИЗ
//		|	Справочник.Длины КАК Длины
//		|ГДЕ
//		|	Длины.Владелец = &Владелец
//		|	И НЕ Длины.ПометкаУдаления
//		|	И Длины.Наименование В (&МассивИмён)";
//		
//	ИначеЕсли ТипИмени = "ПородаСтр" Тогда		
//		
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Породы.Ссылка
//		|ИЗ
//		|	Справочник.Породы КАК Породы
//		|ГДЕ
//		|	НЕ Породы.ПометкаУдаления
//		|	И Породы.Наименование В(&МассивИмён)";
//		
//	ИначеЕсли ТипИмени = "ВлажностьСтр" Тогда		
//		
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Влажность.Ссылка
//		|ИЗ
//		|	Справочник.Влажность КАК Влажность
//		|ГДЕ
//		|	Влажность.Владелец = &Владелец
//		|	И НЕ Влажность.ПометкаУдаления
//		|	И Влажность.Наименование В(&МассивИмён)";
//	
//	
//	КонецЕсли; 
//	
//	Запрос.УстановитьПараметр("Владелец", Объект.КатегорияНоменклатуры); 
//	Запрос.УстановитьПараметр("МассивИмён", МассивИмён);
//	
//	РезультатЗапроса = Запрос.Выполнить(); 	
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	МассивСсылок = Новый Массив;
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 	
//		МассивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);		
//	КонецЦикла;
//	
//	Возврат МассивСсылок;
//	

//КонецФункции

//&НаКлиенте
//Процедура ТабличнаяЧастьПредставлениеПередУдалением(Элемент, Отказ) 
//	
//	УдаляемыйУникальныйИдентификатор = Неопределено;
//	
//	ТекущаяСтрока = Элементы.ТабличнаяЧастьПредставление.ТекущиеДанные;
//	
//	Если Не ТекущаяСтрока = Неопределено тогда
//		УдаляемыйУникальныйИдентификатор = ТекущаяСтрока.Ключ;
//	Иначе
//		Возврат;
//	КонецЕсли;
//	
//	Счетчик = 0;
//	
//	Пока Счетчик < Объект.ТабличнаяЧасть.Количество() Цикл
//		Если Объект.ТабличнаяЧасть[Счетчик].Ключ = УдаляемыйУникальныйИдентификатор тогда
//			Объект.ТабличнаяЧасть.Удалить(Объект.ТабличнаяЧасть[Счетчик]);
//		Иначе
//			Счетчик = Счетчик + 1;
//		КонецЕсли;
//	КонецЦикла; 	
//	
//КонецПроцедуры
